tap "homebrew/bundle"
tap "homebrew/services"

tap "deviceinsight/packages"
brew "deviceinsight/packages/kafkactl"

tap "oktadeveloper/tap"
cask "okta"

# basic system customization
cask "font-hack-nerd-font"
brew "fish"
brew "starship"

tap "cmacrae/formulae"
brew "cmacrae/formulae/spacebar"

tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"

# dev tools
brew "duckdb"
brew "jj"
brew "lazygit"
brew "coreutils"
brew "git"
brew "difftastic"
brew "openssl@3"
brew "gnutls"
brew "readline"
brew "gnupg"
brew "go@1.20"
brew "golang-migrate"
brew "gopls"
brew "jq"
brew "librdkafka"
brew "python@3.12"
brew "neovim"
brew "openssl@1.1"
brew "postgresql@15"
brew "protobuf"
brew "pyright"
brew "python@3.11"
brew "python@3.9"
brew "redis"
brew "ripgrep"
brew "wget"

cask "1password"
cask "1password-cli"
cask "gimp"

# docker
brew install colima
brew install qemu
