brew "coreutils"
brew "git"
brew "fzf"
brew "isync"
brew "jq"
brew "golang-migrate"
brew "neovim"
brew "notmuch"
brew "ripgrep"
brew "tmux"
brew "wget"

brew "cmacrae/formulae/spacebar"
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "starship"
brew "zoxide"

brew "gopls"

brew "openssl"
brew "poetry"
brew "pyenv"
brew "zlib"

brew "rbenv"
brew "ruby-build"
brew "solargraph"

brew "postgresql@15" # for rails

tap "d12frosted/emacs-plus"
brew "emacs-plus"

cask "alacritty"
cask "gimp"
cask "postman"
cask "1password"
cask "1password-cli"
