tap "oktadeveloper/tap"
cask "okta"

# basic system customization
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
brew "fish"
brew "starship"

# dev tools
brew "copilot-cli"
brew "coreutils"
brew "difftastic"
brew "fzf"
brew "git"
brew "gnupg"
brew "gnutls"
brew "go@1.20"
brew "golang-migrate"
brew "gopls"
brew "gotestsum"
brew "jj"
brew "jq"
brew "lazygit"
brew "librdkafka"
brew "neovim"
brew "openssl@3"
brew "poetry"
brew "postgresql@15"
brew "pyright"
brew "python@3.12"
brew "readline"
brew "ripgrep"
brew "wget"

cask "podman-desktop"

cask "1password"
cask "1password-cli"
cask "gimp"
cask "hoppscotch"
